-------------
-------------
BARD

Song of the weave



Any spell, item, or ability that is modified by INF may be modified by WIS instead.

Motif:
DONE: Capriccio - A quick, improvisational, spirited piece of music.
Elegy - An instrumental lament with praise for the dead.
Grandioso - Word to indicate that the movement or entire composition is to be played grandly.
Grave - Word to indicate the movement or entire composition is to be played very slow and serious.
Grazioso - Word to indicate the movement or entire composition is to be played gracefully.
Legato - Word to indicate that the movement or entire composition is to be played smoothly.
Major - One of the two modes of the tonal system. Music written in major keys have a positive affirming character.
March - A form of music written for marching in two-step time. Originally the march was used for military processions.
Minor - One of the two modes of the tonal system. The minor mode can be identified by the dark, melancholic mood.
Nocturne - A musical composition that has a romantic or dreamy character with nocturnal associations.
Requiem - A dirge, hymn, or musical service for the repose of the dead.
Vivace - Direction to performer to play a composition in a brisk, lively, and spirited manner.


Measure modifiers:
Energico - A symbol in sheet music a direction to play energetically.
Forte - A symbol indicating to play loud.
Tremolo - Quick repetition of the same note or the rapid alternation between two notes.
Portamento - A mild glissando between two notes for an expressive effect.
Monotone - Repetition of a single tone.

Beat modifiers:
Glissando - Sliding between two notes.
Fermata - To hold a tone or rest held beyond the written value at the discretion of the performer.
Duet - A piece of music written for two vocalists or instrumentalists.
Chord - 3 or 4 notes played simultaneously in harmony.
Modulation - To shift to another key.
Pitch - The frequency of a note determining how high or low it sounds.
Polytonality - Combination of two or more keys being played at the same time.


Note types:
Flat - A symbol indicating that the note is to be diminished by one semitone.
Natural - Not flat or sharp

Composition dynamics:
Cadence - A sequence of chords that brings an end to a phrase, either in the middle or the end of a composition.
Cadenza - Initially an improvised cadence by a soloist; later becoming an elaborate and written out passage in an aria or concerto, featuring the skills of an instrumentalist or vocalist.
Deceptive cadence - A chord progression that seems to lead to resolving itself on the final chord; but does not.
Cavatina - A short and simple melody performed by a soloist that is part of a larger piece.
Chord progression - A string of chords played in succession.
Dissonance - Harsh, discordant, and lack of harmony. Also a chord that sounds incomplete until it resolves itself on a harmonious chord.
Encore - A piece of music played at the end of a recital responding to the audiences enthusiastic reaction to the performance, shown by continuous applause.
Finale - Movement or passage that concludes the musical composition.
Interlude - Piece of instrumental music played between scenes in a play or opera.
Medley - Often used in overtures, a composition that uses passages from other movements of the composition in its entirety.
Movement - A separate section of a larger composition.
Ostinato - A repeated phrase.
Progression - The movement of chords in succession.
Refrain - A repeating phrase that is played at the end of each verse in the song.
Reprise - To repeat a previous part of a composition generally after other music has been played.


Definitions:
Beat - The unit of musical rhythm.
Clef - In sheet music, a symbol at the beginning of the staff defining the pitch of the notes found in that particular staff.
Dynamics - Pertaining to the loudness or softness of a musical composition. Also the symbols in sheet music indicating volume.
Harmony - Pleasing combination of two or three tones played together in the background while a melody is being played. Harmony also refers to the study of chord progressions.
Key signature - The flats and sharps at the beginning of each staff line indicating the key of music the piece is to be played.
Measure - The unit of measure where the beats on the lines of the staff are divided up into two, three, four beats to a measure.
Motif - Primary theme or subject that is developed.
Phrase - A single line of music played or sung. A musical sentence.
Rhythm - The element of music pertaining to time, played as a grouping of notes into accented and unaccented beats.
Tempo - Indicating speed.
Theme - A melodic or, sometimes a harmonic idea presented in a musical form.
Time Signature - A numeric symbol in sheet music determining the number of beats to a measure.
4/4 - imperfect time (four four time)
3/2 or 3/4 - perfect time (three four time)
2/2 - cut time (two two time)
6/8 six eight time



Beats:
Chromatic scale - Includes all twelve notes of an octave.

Abilities:
Chant - Singing in unison, texts in a free rhythm. Similar to the rhythm of speech.
Conductor - One who directs a group of performers. The conductor indicates the tempo, phrasing, dynamics, and style by gestures and facial expressions.
Maestro - Refers to any great composer, conductor, or teacher of music.
Scordatura - The retuning of a stringed instrument in order to play notes below the ordinary range of the instrument or to produce an usual tone color.
Temperament - Refers to the tuning of an instrument.
Virtuoso - A person with notable technical skill in the performance of music.




--------------
--------------
ARTIFICER

Link to Sentium drone
Construct mecha drone
Construct drone swarm



--------------
--------------
MECHA DRONE




Move
Run
Jump
Climb
Metal carapace

Dodge
Use cover
Disengage
Hide
Delay
Ready
Opportunity attack
Search
Remote senses

Improvise


Mechanized arm

// Replaced with the notion that attacks with normal weapons are at disadvantage because there is no proficency.
Caclulated attack
{
  "name": "Calculated attack",
  "type of ability": "passive",
  "target": "self",
  "properties": "STR AR, DEX AR, and Spell AR are always +2.<br>STR DMG, DEX DMG, and Spell DMG are always 0. Certain abilities may be modified by the attribute's score, but using conventional weapons or spells provides no modifications beyond that designated here."
},


Propulsive wallop
Electric prod

--------------
--------------
BATTLEMAGE

Violent death (explode if below 10 HP):

Warden's chains (snare a target):

Force push:

Force pull:

Shocking grasp:

Flame augmentation:

Ice augmentation:

Lightning augmentation:

Poison tipped:

Summon weapon:

Barrier:

Blink
Phase
Thunderwave
Burning hands
Jump
Grease
Thaumaturgy

Smoke form
Magic resistant
Restoring blood
Adrenaline rush
Duel weapons
Shield adept
Quick attack
Heavy attack
Reach attack
Armored mage
Armored BATTLEMAGE
Parry
Counter attack

Phase weapon (make it temporarily disapear so that hand spells can be used)

Unlimited attunment of weapon


-------------
-------------
ELEMENTALIST

Magic resistant
Magicborn
Magic immune

Earth tracer
Earth weaver
Earth master

Hurl rock

Earth skin:

Pebble barrage:

Wall of stone:

Stone columns:

Tremor:

Earthquake:

Earth elemental:

Tremorsense
Dig
Fast dig

--

Fire tracer:

Fire weaver:

Fire master:

Fireball:

Dragon's breath (burning hands):

Spontanous Combustion:

Fire storm:

Resist heat:

Fire immune:

Light:

Ignite: (fire over time)

Searing pain: (STR ST or unable to take actions)

Kindle flame: (increases the stats of the next fire DMG spell)

Heat metal:

Control file:

Summon spark dancers (summons X many spark dancer, which is a small fire demon):

Heated barrier (any target within 5 ft takes fire DMG):

Flame daggers:

Flame whip:

Fire walk:

Fire elemental:

--

Water tracer
Water weaver
Water master

Ice bolt

Water whip

Hold breath
Breathe water

Give breathe water:

Natural swimmer
Water walk
Control water

Tidal shove

Sweat tomb (encloses a target in a layer of water):

Exploding bubbles:

Ice sheet:

Chilling gaze

Whirlpool:

Glacier:

Water elemental:

--

Air tracer:

Air weaver:

Air master:

Forceful winds:

Flying weapons:

Thunderwave
Gust of wind
Thunderburst

Cyclone trap:

Zone of silence:

Hold person:

Dive bomb:

Sufficate:

Air elemental:

Extra move (for air)
Extra move II (for air)
Hover
Fly

Lightning storm
Smoke form
Fog cloud

Moving dodge
Nimble



-----------------
-----------------
THEIF AND ASSASSIN
Double move
Fast run
Double run
Natural climber
Mimicry
Camouflage
Feign inanimated
Cautious retreat
Quick dodge
Extra move
Extra move II
Standing leap
Honed critical
Melee weapon specialist
Ranged weapon specialist
Melee weapon master
Ranged weapon master
Mastered critical
Reactive movement
Disarming strike
Trip attack
Duel weapons
Quick attack
Rapid attack
Nimble
Rogue Nimble
Side step
Moving dodge
Counter attack

Sneak attack:
+X DMG on Surprise attacks.

Sneak attack II (III, IV, etc):
+X DMG on surprise attacks.

Thieves cant:
Read and write a secret code known by thieves to guide members to secret hideouts, or inform about precautions in the specific city.

Trap sweeper:
+X to Investigation rolls regarding traps or hidden objects.

Hiding in plain sight:
A Stealth check only requires 1 action point.

Swift as shadows:
As long as you are not moving and are not detected by anyone other than allies, you may perform a Stealth check as a reaction.

Firewalker:
If a successful ST is made against an AoE spell, take no DMG.

Soundsense:
30 ft radius
Can pinpoint location of any object or creature producing audible sound.  If a creature is Stealthed, a Perception check is required to perceive its presense and pinpoint its location.

Stroke of luck:
May reroll a failed AR, ST, or ability check.

Pickpocket:
If you have a free hand, may make a Sleight of hand check as an AR.  If hit, you may take one item from the target that he is not holding and is immediately accessable.<br>If the item is bound to the target, or worn by the target, -5 to the AR.

Surprise performance:
If you enter combat with a Surprise attack, initiative begins with you at the top of the round.

+4 to Perform.

Deadly surprise:
+5 to AR on Surprise attacks. If hit, the attack is a critical hit.

Opportunist:
Any attack against a target that hasn't taken a turn in combat yet is a Surprise attack.

Assassinate:
If an attack is a critical hit, roll a d20.<br>If the result is a 19, +50 DMG to the attack.<br>If the result is a 20, +300 DMG to the attack.

Imposter:
+5 to Deception checks when attempting to act or behave as someone else.

Serial killer:
If your attack kills a target, regain all lost action points for this turn.  Can only be activated once per turn.

Poison tipped:
Recharge: shard.
First hit weapon attack deals +1d6 poison DMG.

Prey vision:
Recharge: shard.
Duration: 10 minutes.
Radius: 500 ft
Mark a target within your vision.  As long as the target stays within radius, you know the location of the target.<br>You may also make a single guess to the target's max health and challenge rating.  The GM will say if the guesses are too high, too low, or correct.

Trap maker:
Prepare up to a trap ahead of time.<br>Each trap takes 30 minutes to prepare.

Trap maker II:
Prepare up to 2 traps ahead of time.<br>Each trap takes 15 minutes to prepare.<br>You prepare a trap in such a way that you may choose to prevent yourself from triggering the trap.

Trap maker III:
Prepare up to 3 traps ahead of time.<br>Each trap takes 10 minutes to prepare.<br>You prepare a trap in such a way that you may choose to prevent yourself from triggering the trap.<br>You may also choose to be unaffected by a trap's activated ability, even if you trigger the trap.

Place traps:
"target": "target",
"range (ft)": 30,
"number of targets": 1,
"action points": 2,
Set a prepared trap on the ground or on a wall.  Traps cannot be placed at the spot a creature is already standing.  The trap will become active at the end of your next turn.  The trap is triggered when a creature moves onto the traps activation zone.  A trap has an activation of a 5 foot square centered on the trap, unless otherwise specified.  Once activated, the target that triggered the trap is affected by the trap, as well as any target within the trap's ability radius.  Once a trap is triggered, it cannot be reused.

Snare trap:
Target is Snared until a STR check of 16 is made against the trap.

Exploding trap:
Radius 10 ft
d10*2 fire DMG

Prey trap:
Activates Prey vision on the target that triggered the trap.

